Tekla.Structures.Dialog.AttributeTypeNameEditor
The AttributeTypeNameEditor class provides a user interface for selecting a type for the bound attribute.

Tekla.Structures.Dialog.AttributeTypeNameEditor.EditValue(System.ComponentModel.ITypeDescriptorContext,System.IServiceProvider,System.Object)
Edits the specified object's value using the editor style indicated by the GetEditStyle method.
context:
An ITypeDescriptorContext that can be used to gain additional context information.
provider: An IServiceProvider that the editor can use to obtain services.
value: The object to edit.
Returns:
The new value of the object. If the value of the object has not changed, this should return
the same object it was passed.

Tekla.Structures.Dialog.AttributeTypeNameEditor.GetEditStyle(System.ComponentModel.ITypeDescriptorContext)
Gets the editor style used by the EditValue method.
context: An ITypeDescriptorContext that can be used to gain additional context information.
Returns:
A UITypeEditorEditStyle value that indicates the style of the editor used by the EditValue method.
If the UITypeEditor does not support the method, then GetEditStyle will return None.